zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cx_sg/pic32cx_sg41/pic32cx1025sg41100-pinctrl.h
/* pa22b_adc0_y16 */
#define PA22B_ADC0_Y16 MCHP_PINMUX(a, 22, b, periph)

/* pa22c_sercom3_pad0 */
#define PA22C_SERCOM3_PAD0 MCHP_PINMUX(a, 22, c, periph)

/* pa22d_sercom5_pad1 */
#define PA22D_SERCOM5_PAD1 MCHP_PINMUX(a, 22, d, periph)

/* pa22e_tc4_wo0 */
#define PA22E_TC4_WO0 MCHP_PINMUX(a, 22, e, periph)

/* pa22f_tcc1_wo6 */
#define PA22F_TCC1_WO6 MCHP_PINMUX(a, 22, f, periph)

/* pa22g_tcc0_wo2 */
#define PA22G_TCC0_WO2 MCHP_PINMUX(a, 22, g, periph)

/* pa22i_can0_tx */
#define PA22I_CAN0_TX MCHP_PINMUX(a, 22, i, periph)

/* pa22j_i2s_sdi */
#define PA22J_I2S_SDI MCHP_PINMUX(a, 22, j, periph)

/* pa22k_pcc_data6 */
#define PA22K_PCC_DATA6 MCHP_PINMUX(a, 22, k, periph)

/* pa22n_ccl_in6 */
#define PA22N_CCL_IN6 MCHP_PINMUX(a, 22, n, periph)

/* pa23_gpio */
#define PA23_GPIO MCHP_PINMUX(a, 23, gpio, gpio)

/* pa23a_eic_extint7 */
#define PA23A_EIC_EXTINT7 MCHP_PINMUX(a, 23, a, periph)

/* pa23b_adc0_x17 */
#define PA23B_ADC0_X17 MCHP_PINMUX(a, 23, b, periph)

/* pa23b_adc0_y17 */
#define PA23B_ADC0_Y17 MCHP_PINMUX(a, 23, b, periph)

/* pa23c_sercom3_pad1 */
#define PA23C_SERCOM3_PAD1 MCHP_PINMUX(a, 23, c, periph)

/* pa23d_sercom5_pad0 */
#define PA23D_SERCOM5_PAD0 MCHP_PINMUX(a, 23, d, periph)

/* pa23e_tc4_wo1 */
#define PA23E_TC4_WO1 MCHP_PINMUX(a, 23, e, periph)

/* pa23f_tcc1_wo7 */
#define PA23F_TCC1_WO7 MCHP_PINMUX(a, 23, f, periph)

/* pa23g_tcc0_wo3 */
#define PA23G_TCC0_WO3 MCHP_PINMUX(a, 23, g, periph)

/* pa23h_usb_sof_1khz */
#define PA23H_USB_SOF_1KHZ MCHP_PINMUX(a, 23, h, periph)

/* pa23i_can0_rx */
#define PA23I_CAN0_RX MCHP_PINMUX(a, 23, i, periph)

/* pa23j_i2s_fs1 */
#define PA23J_I2S_FS1 MCHP_PINMUX(a, 23, j, periph)

/* pa23k_pcc_data7 */
#define PA23K_PCC_DATA7 MCHP_PINMUX(a, 23, k, periph)

/* pa23n_ccl_in7 */
#define PA23N_CCL_IN7 MCHP_PINMUX(a, 23, n, periph)

/* pa24_gpio */
#define PA24_GPIO MCHP_PINMUX(a, 24, gpio, gpio)

/* pa24a_eic_extint8 */
#define PA24A_EIC_EXTINT8 MCHP_PINMUX(a, 24, a, periph)

/* pa24c_sercom3_pad2 */
#define PA24C_SERCOM3_PAD2 MCHP_PINMUX(a, 24, c, periph)

/* pa24d_sercom5_pad2 */
#define PA24D_SERCOM5_PAD2 MCHP_PINMUX(a, 24, d, periph)

/* pa24e_tc5_wo0 */
#define PA24E_TC5_WO0 MCHP_PINMUX(a, 24, e, periph)

/* pa24f_tcc2_wo2 */
#define PA24F_TCC2_WO2 MCHP_PINMUX(a, 24, f, periph)

/* pa24g_pdec_qdi0 */
#define PA24G_PDEC_QDI0 MCHP_PINMUX(a, 24, g, periph)

/* pa24h_usb_dm */
#define PA24H_USB_DM MCHP_PINMUX(a, 24, h, periph)

/* pa24i_can0_tx */
#define PA24I_CAN0_TX MCHP_PINMUX(a, 24, i, periph)

/* pa24n_ccl_in8 */
#define PA24N_CCL_IN8 MCHP_PINMUX(a, 24, n, periph)

/* pa25_gpio */
#define PA25_GPIO MCHP_PINMUX(a, 25, gpio, gpio)

/* pa25a_eic_extint9 */
#define PA25A_EIC_EXTINT9 MCHP_PINMUX(a, 25, a, periph)

/* pa25c_sercom3_pad3 */
#define PA25C_SERCOM3_PAD3 MCHP_PINMUX(a, 25, c, periph)

/* pa25d_sercom5_pad3 */
#define PA25D_SERCOM5_PAD3 MCHP_PINMUX(a, 25, d, periph)

/* pa25e_tc5_wo1 */
#define PA25E_TC5_WO1 MCHP_PINMUX(a, 25, e, periph)

/* pa25g_pdec_qdi1 */
#define PA25G_PDEC_QDI1 MCHP_PINMUX(a, 25, g, periph)

/* pa25h_usb_dp */
#define PA25H_USB_DP MCHP_PINMUX(a, 25, h, periph)

/* pa25i_can0_rx */
#define PA25I_CAN0_RX MCHP_PINMUX(a, 25, i, periph)

/* pa25n_ccl_out2 */
#define PA25N_CCL_OUT2 MCHP_PINMUX(a, 25, n, periph)

/* pa27_gpio */
#define PA27_GPIO MCHP_PINMUX(a, 27, gpio, gpio)

/* pa27a_eic_extint11 */
#define PA27A_EIC_EXTINT11 MCHP_PINMUX(a, 27, a, periph)

/* pa27b_adc0_x18 */
#define PA27B_ADC0_X18 MCHP_PINMUX(a, 27, b, periph)

/* pa27b_adc0_y18 */
#define PA27B_ADC0_Y18 MCHP_PINMUX(a, 27, b, periph)

/* pa27m_gclk_io1 */
#define PA27M_GCLK_IO1 MCHP_PINMUX(a, 27, m, periph)

/* pa30_gpio */
#define PA30_GPIO MCHP_PINMUX(a, 30, gpio, gpio)

/* pa30a_eic_extint14 */
#define PA30A_EIC_EXTINT14 MCHP_PINMUX(a, 30, a, periph)

/* pa30b_adc0_x19 */
#define PA30B_ADC0_X19 MCHP_PINMUX(a, 30, b, periph)

/* pa30b_adc0_y19 */
#define PA30B_ADC0_Y19 MCHP_PINMUX(a, 30, b, periph)

/* pa30c_sercom7_pad2 */
#define PA30C_SERCOM7_PAD2 MCHP_PINMUX(a, 30, c, periph)

/* pa30d_sercom1_pad2 */
#define PA30D_SERCOM1_PAD2 MCHP_PINMUX(a, 30, d, periph)

/* pa30e_tc6_wo0 */
#define PA30E_TC6_WO0 MCHP_PINMUX(a, 30, e, periph)

/* pa30f_tcc2_wo0 */
#define PA30F_TCC2_WO0 MCHP_PINMUX(a, 30, f, periph)

/* pa30m_gclk_io0 */
#define PA30M_GCLK_IO0 MCHP_PINMUX(a, 30, m, periph)

/* pa30n_ccl_in3 */
#define PA30N_CCL_IN3 MCHP_PINMUX(a, 30, n, periph)

/* pa31_gpio */
#define PA31_GPIO MCHP_PINMUX(a, 31, gpio, gpio)

/* pa31a_eic_extint15 */
#define PA31A_EIC_EXTINT15 MCHP_PINMUX(a, 31, a, periph)

/* pa31c_sercom7_pad3 */
#define PA31C_SERCOM7_PAD3 MCHP_PINMUX(a, 31, c, periph)

/* pa31d_sercom1_pad3 */
#define PA31D_SERCOM1_PAD3 MCHP_PINMUX(a, 31, d, periph)

/* pa31e_tc6_wo1 */
#define PA31E_TC6_WO1 MCHP_PINMUX(a, 31, e, periph)

/* pa31f_tcc2_wo1 */
#define PA31F_TCC2_WO1 MCHP_PINMUX(a, 31, f, periph)

/* pa31n_ccl_out1 */
#define PA31N_CCL_OUT1 MCHP_PINMUX(a, 31, n, periph)

/* pb0_gpio */
#define PB0_GPIO MCHP_PINMUX(b, 0, gpio, gpio)

/* pb0a_eic_extint0 */
#define PB0A_EIC_EXTINT0 MCHP_PINMUX(b, 0, a, periph)

/* pb0b_adc0_ain12 */
#define PB0B_ADC0_AIN12 MCHP_PINMUX(b, 0, b, periph)

/* pb0b_adc0_x30 */
#define PB0B_ADC0_X30 MCHP_PINMUX(b, 0, b, periph)

/* pb0b_adc0_y30 */
#define PB0B_ADC0_Y30 MCHP_PINMUX(b, 0, b, periph)

/* pb0d_sercom5_pad2 */
#define PB0D_SERCOM5_PAD2 MCHP_PINMUX(b, 0, d, periph)

/* pb0e_tc7_wo0 */
#define PB0E_TC7_WO0 MCHP_PINMUX(b, 0, e, periph)

/* pb0n_ccl_in1 */
#define PB0N_CCL_IN1 MCHP_PINMUX(b, 0, n, periph)

/* pb1_gpio */
#define PB1_GPIO MCHP_PINMUX(b, 1, gpio, gpio)

/* pb1a_eic_extint1 */
#define PB1A_EIC_EXTINT1 MCHP_PINMUX(b, 1, a, periph)

/* pb1b_adc0_ain13 */
#define PB1B_ADC0_AIN13 MCHP_PINMUX(b, 1, b, periph)

/* pb1b_adc0_x31 */
#define PB1B_ADC0_X31 MCHP_PINMUX(b, 1, b, periph)

/* pb1b_adc0_y31 */
#define PB1B_ADC0_Y31 MCHP_PINMUX(b, 1, b, periph)

